УчетВУправляющихДляГит1/src/Reports/РегламентированныйОтчетСтатистикаФормаПУслуги/РегламентированныйОтчетСтатистикаФормаПУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегламентированныйОтчетСтатистикаФормаПУслуги</name>
</mdclass:Report>

УчетВУправляющихДляГит1/src/Enums/ВерсииФорматовВыгрузки/ВерсииФорматовВыгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВерсииФорматовВыгрузки</name>
  <enumValues>
    <name>Версия200</name>
  </enumValues>
  <enumValues>
    <name>Версия201</name>
  </enumValues>
  <enumValues>
    <name>Версия201алко</name>
  </enumValues>
  <enumValues>
    <name>Версия300</name>
  </enumValues>
  <enumValues>
    <name>Версия300алко</name>
  </enumValues>
  <enumValues>
    <name>Версия301алко</name>
  </enumValues>
  <enumValues>
    <name>Версия302алко</name>
  </enumValues>
  <enumValues>
    <name>Версия400</name>
  </enumValues>
  <enumValues>
    <name>Версия401алко</name>
  </enumValues>
  <enumValues>
    <name>Версия500</name>
  </enumValues>
  <enumValues>
    <name>Версия700ПФР</name>
  </enumValues>
  <enumValues>
    <name>ВерсияФСГС</name>
    <comment>Для статотчетности</comment>
  </enumValues>
  <enumValues>
    <name>ВерсияФСС</name>
  </enumValues>
  <enumValues>
    <name>ВерсияРПН</name>
    <comment>Для отчетов в Росприроднадзор</comment>
  </enumValues>
  <enumValues>
    <name>ВерсияБанкРоссии</name>
    <comment>Для отчетов в Банк России</comment>
  </enumValues>
  <enumValues>
    <name>ВерсияПФР</name>
  </enumValues>
  <enumValues>
    <name>ВерсияМинобороны</name>
    <comment>Для отчетов в Министерство Обороны</comment>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Reports/РегламентированныйОтчетСтатистикаФормаПУслуги/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Если НаДату > '20110101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.ВерсияФСГС;
	КонецЕсли;
		
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2017Кв1";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Росстата от 04.08.2016 № 388.";
	НоваяФорма.РедакцияФормы      = "от 04.08.2016 № 388.";
	НоваяФорма.ДатаНачалоДействия = '20170101';
	НоваяФорма.ДатаКонецДействия  = '20171231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2018Кв1";
	НоваяФорма.ОписаниеОтчета     = "Утверждена приказом Росстата от 31.08.2017 № 564.";
	НоваяФорма.РедакцияФормы      = "от 31.08.2017 № 564.";
	НоваяФорма.ДатаНачалоДействия = '20180101';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ДанныеРеглОтчета(ЭкземплярРеглОтчета) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Функция ДеревоФормИФорматов() Экспорт
	
	ФормыИФорматы = Новый ДеревоЗначений;
	ФормыИФорматы.Колонки.Добавить("Код");
	ФормыИФорматы.Колонки.Добавить("ДатаПриказа");
	ФормыИФорматы.Колонки.Добавить("НомерПриказа");
	ФормыИФорматы.Колонки.Добавить("ДатаНачалаДействия");
	ФормыИФорматы.Колонки.Добавить("ДатаОкончанияДействия");
	ФормыИФорматы.Колонки.Добавить("ИмяОбъекта");
	ФормыИФорматы.Колонки.Добавить("Описание");
	
	Форма20140101 = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "609707", '20160804', "388",	"ФормаОтчета2017Кв1");
	РегламентированнаяОтчетность.ОпределитьФорматВДеревеФормИФорматов(Форма20140101, "27-04-2017");
	Форма20140101 = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "609707", '20170831', "564",	"ФормаОтчета2018Кв1");
	РегламентированнаяОтчетность.ОпределитьФорматВДеревеФормИФорматов(Форма20140101, "27-12-2018");
	
	Возврат ФормыИФорматы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

#КонецОбласти

#Если Не ВнешнееСоединение Тогда
#Область ФормированиеТекстаВыгрузки

Функция ТекстВыгрузкиОтчетаСтатистики(мСохраненныйДок, ВыбраннаяФорма) Экспорт 
	ТекстВыгрузки = "";
	Если ВыбраннаяФорма = "ФормаОтчета2017Кв1" Тогда 
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(мСохраненныйДок, "Периодичность,Организация,ДатаПодписи");
		ИмяАтрибутов = ?(РеквизитыДокумента.Периодичность = Перечисления.Периодичность.Месяц, "АтрибВыгрузкиXML2017Кв1_месяц", "АтрибВыгрузкиXML2017Кв1_квартал");
		КонтекстФормы = УниверсальныйОтчетСтатистики.СформироватьКонтекстФормыДляПоказателей(мСохраненныйДок);
		ПараметрыВыгрузки = УниверсальныйОтчетСтатистики.СформироватьСтруктуруПараметров(КонтекстФормы, мСохраненныйДок, ИмяАтрибутов);
		СтрокаСведений = "ОКВЭД2, ОКФС";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(РеквизитыДокумента.Организация, РеквизитыДокумента.ДатаПодписи, СтрокаСведений);
		ПараметрыВыгрузки.Вставить("ОКВЭД", СведенияОбОрганизации.ОКВЭД2);
		ПараметрыВыгрузки.Вставить("ОКФС", СведенияОбОрганизации.ОКФС);
		ДеревоВыгрузки = РегламентированнаяОтчетность.ПолучитьДеревоВыгрузки(КонтекстФормы, "СхемаВыгрузкиXML2017Кв1");
		УниверсальныйОтчетСтатистики.ЗаполнитьДанными(КонтекстФормы, ДеревоВыгрузки, ПараметрыВыгрузки);
		ТекстВыгрузки = РегламентированнаяОтчетность.ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки);
	ИначеЕсли ВыбраннаяФорма = "ФормаОтчета2018Кв1" Тогда 
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(мСохраненныйДок, "Периодичность,Организация,ДатаПодписи");
		ИмяАтрибутов = ?(РеквизитыДокумента.Периодичность = Перечисления.Периодичность.Месяц, "АтрибВыгрузкиXML2018Кв1_месяц", "АтрибВыгрузкиXML2018Кв1_квартал");
		КонтекстФормы = УниверсальныйОтчетСтатистики.СформироватьКонтекстФормыДляПоказателей(мСохраненныйДок);
		ПараметрыВыгрузки = УниверсальныйОтчетСтатистики.СформироватьСтруктуруПараметров(КонтекстФормы, мСохраненныйДок, ИмяАтрибутов);
		СтрокаСведений = "ОКВЭД2, ОКФС";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(РеквизитыДокумента.Организация, РеквизитыДокумента.ДатаПодписи, СтрокаСведений);
		ПараметрыВыгрузки.Вставить("ОКВЭД", СведенияОбОрганизации.ОКВЭД2);
		ПараметрыВыгрузки.Вставить("ОКФС", СведенияОбОрганизации.ОКФС);
		ДеревоВыгрузки = РегламентированнаяОтчетность.ПолучитьДеревоВыгрузки(КонтекстФормы, "СхемаВыгрузкиXML2018Кв1");
		УниверсальныйОтчетСтатистики.ЗаполнитьДанными(КонтекстФормы, ДеревоВыгрузки, ПараметрыВыгрузки);
		ТекстВыгрузки = РегламентированнаяОтчетность.ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки);
	КонецЕсли;
	
	Возврат ТекстВыгрузки;
КонецФункции

#КонецОбласти
#КонецЕсли

#КонецЕсли
